; domain
(define (domain dwr)
  (:requirements :strips :typing :negative-preconditions :equality)

  (:types
    location  ; there are several connected locations in the harbor
    pile      ; is attached to a location, it holds a pallet and a stack of containers
    robot     ; holds at most 1 container, only 1 robot per location
    crane     ; belongs to a location to pickup containers
    container
  )

  (:predicates
    (adjacent ?l1 ?l2 - location)       ; location ?l1 is adjacent ot ?l2
    (attached ?p - pile ?l - location)  ; pile ?p attached to location ?l
    (belong ?k - crane ?l - location)   ; crane ?k belongs to location ?l
    (at ?r - robot ?l - location)       ; robot ?r is at location ?l
    (occupied ?l - location)            ; there is a robot at location ?l
    (loaded ?r - robot ?c - container ) ; robot ?r is loaded with container ?c
    (unloaded ?r - robot)               ; robot ?r is empty
    (holding ?k - crane ?c - container) ; crane ?k is holding a container ?c
    (empty ?k - crane)                  ; crane ?k is empty
    (in ?c - container ?p - pile)       ; container ?c is within pile ?p
    (top ?c - container ?p - pile)      ; container ?c is on top of pile ?p
    (on ?k1 ?k2 - container)            ; container ?k1 is on container ?k2
    (equal ?c1 ?c2)                     ; container ?c1 is equal ?c2
  )

  ; moves a robot between two adjacent locations
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (adjacent ?from ?to) (at ?r ?from) (not (occupied ?to)))
    :effect (and (at ?r ?to) (not (occupied ?from)) (occupied ?to) (not (at ?r ?from)))
  )

  ; loads an empty robot with a container held by a nearby crane
  (:action load
    :parameters (?k - crane ?r - robot ?c - container ?l - location)
    :precondition (and (at ?r ?l) (belong ?k ?l) (holding ?k ?c) (unloaded ?r) (not (equal ?c pallet)))
    :effect (and  (loaded ?r ?c) (not (unloaded ?r)) (empty ?k) (not (holding ?k ?c)))
  )

  ; unloads a robot holding a container with a nearby crane
  (:action unload
    :parameters (?k - crane ?r - robot ?c - container ?l - location)
    :precondition (and (belong ?k ?l) (at ?r ?l) (loaded ?r ?c) (empty ?k) (not (equal ?c pallet)))
    :effect (and (unloaded ?r) (holding ?k ?c) (not (loaded ?r ?c)) (not (empty ?k)))
  )

  ; puts a container held by a crane on a pile
  (:action put
    :parameters (?k - crane ?c - container ?c2 - container ?p - pile ?l - location)
    :precondition (and (belong ?k ?l) (attached ?p ?l) (holding ?k ?c) (top ?c2 ?p) (not (equal ?c ?c2)) (not (equal ?c pallet)))
    :effect (and (in ?c ?p) (top ?c ?p) (on ?c ?c2) (not (top ?c2 ?p)) (not (holding ?k ?c)) (empty ?k))
  )

  ; takes a container from a pile with a crane
  (:action take
    :parameters (?k - crane ?c - container ?c2 - container ?p - pile ?l - location)
    :precondition (and (belong ?k ?l) (attached ?p ?l) (empty ?k) (in ?c ?p) (top ?c ?p) (on ?c ?c2) (not (equal ?c ?c2)) (not (equal ?c pallet)))
    :effect (and (holding ?k ?c) (top ?c2 ?p) (not (in ?c ?p)) (not (top ?c ?p)) (not (on ?c ?c2)) (not (empty ?k)))
  )
)

; problem
(define (problem pb1)
  (:domain dwr)
  (:objects
    r1 - robot
    l1 l2 - location
    k1 k2 - crane
    p1 q1 p2 q2 - pile
    ca cb cc cd ce cf pallet - container
  )
  (:init
    (adjacent l1 l2) (adjacent l2 l1)
    (attached p1 l1) (attached q1 l1)
    (attached p2 l2) (attached q2 l2)
    (belong k1 l1)
    (belong k2 l2)
    (in ca p1) (in cb p1) (in cc p1)
    (in cd q1) (in ce q1) (in cf q1)
    (top cc p1) (on cc cb) (on cb ca) (on ca pallet)
    (top cf q1) (on cf ce) (on ce cd) (on cd pallet)
    (top pallet p2)
    (top pallet q2)
    (at r1 l1)
    (unloaded r1)
    (occupied l1)
    (empty k1)
    (empty k2)
    (equal ca ca) (equal cb cb) (equal cc cc) (equal cd cd) (equal ce ce) (equal cf cf) (equal pallet pallet)
  )
  ; the task is to move all containers to location l2
  ; ca and cc in pile p2, cc in q2
  (:goal (and (in ca p2) (in cb q2) (in cc p2) (not(in pepito))))
)

; plan
1. (take k1 cc cb p1 l1)
   deleted: (in cc p1) (top cc p1) (on cc cb) (empty k1)
   added: (holding k1 cc) (top cb p1)
   goals met: 1 of 4
2. (load k1 r1 cc l1)
   deleted: (unloaded r1) (holding k1 cc)
   added: (loaded r1 cc) (empty k1)
   goals met: 1 of 4
3. (move r1 l1 l2)
   deleted: (occupied l1) (at r1 l1)
   added: (at r1 l2) (occupied l2)
   goals met: 1 of 4
4. (unload k2 r1 cc l2)
   deleted: (loaded r1 cc) (empty k2)
   added: (unloaded r1) (holding k2 cc)
   goals met: 1 of 4
5. (put k2 cc pallet p2 l2)
   deleted: (top pallet p2) (holding k2 cc)
   added: (in cc p2) (top cc p2) (on cc pallet) (empty k2)
   goals met: 2 of 4
6. (take k1 cb ca p1 l1)
   deleted: (in cb p1) (top cb p1) (on cb ca) (empty k1)
   added: (holding k1 cb) (top ca p1)
   goals met: 2 of 4
7. (move r1 l2 l1)
   deleted: (occupied l2) (at r1 l2)
   added: (at r1 l1) (occupied l1)
   goals met: 2 of 4
8. (load k1 r1 cb l1)
   deleted: (unloaded r1) (holding k1 cb)
   added: (loaded r1 cb) (empty k1)
   goals met: 2 of 4
9. (move r1 l1 l2)
   deleted: (occupied l1) (at r1 l1)
   added: (at r1 l2) (occupied l2)
   goals met: 2 of 4
10. (unload k2 r1 cb l2)
   deleted: (loaded r1 cb) (empty k2)
   added: (unloaded r1) (holding k2 cb)
   goals met: 2 of 4
11. (put k2 cb pallet q2 l2)
   deleted: (top pallet q2) (holding k2 cb)
   added: (in cb q2) (top cb q2) (on cb pallet) (empty k2)
   goals met: 3 of 4
12. (take k1 ca pallet p1 l1)
   deleted: (in ca p1) (top ca p1) (on ca pallet) (empty k1)
   added: (holding k1 ca) (top pallet p1)
   goals met: 3 of 4
13. (move r1 l2 l1)
   deleted: (occupied l2) (at r1 l2)
   added: (at r1 l1) (occupied l1)
   goals met: 3 of 4
14. (load k1 r1 ca l1)
   deleted: (unloaded r1) (holding k1 ca)
   added: (loaded r1 ca) (empty k1)
   goals met: 3 of 4
15. (move r1 l1 l2)
   deleted: (occupied l1) (at r1 l1)
   added: (at r1 l2) (occupied l2)
   goals met: 3 of 4
16. (unload k2 r1 ca l2)
   deleted: (loaded r1 ca) (empty k2)
   added: (unloaded r1) (holding k2 ca)
   goals met: 3 of 4
17. (put k2 ca cc p2 l2)
   deleted: (top cc p2) (holding k2 ca)
   added: (in ca p2) (top ca p2) (on ca cc) (empty k2)
   goals met: 4 of 4
